---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wave.WaveRandomSeed
source: html/c1e86fae-72f8-31b7-74b8-c2b1b9b30c05.htm
---
# Autodesk.Revit.DB.Visual.Wave.WaveRandomSeed Property

The property labeled "Random Seed" from the "Wave" schema.

## Syntax (C#)
```csharp
public static string WaveRandomSeed { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" within the range of "0, 65535".